In [ ]:
%load_ext sql

In [25]:
%sql sqlite:///hogwarts.sqlite

In [27]:
import sql

In [35]:
import prettytable

In [37]:
from sql import run

In [33]:
run.style = prettytable.PLAIN_COLUMNS

In [41]:
#Просмотр таблиц
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///hogwarts.sqlite
Done.

[('library',), ('sqlite_sequence',), ('characters',)]

In [45]:
#Все персонажи без патронуса

%%sql
SELECT fname, lname, patronus FROM characters WHERE patronus IS NULL;

 * sqlite:///hogwarts.sqlite
Done.

[('Draco', 'Malfoy', None),
 ('Vincent', 'Crabbe', None),
 ('Gregory', 'Goyle', None),
 ('Lord', 'Voldemort', None)]

In [51]:
#Все персонажи  с известным патронусом

%%sql
SELECT fname, lname, patronus
FROM characters
WHERE patronus IS NOT NULL;

 * sqlite:///hogwarts.sqlite
Done.

[('Harry', 'Potter', 'Stag'),
 ('Hermione', 'Granger', 'Otter'),
 ('Ron', 'Weasley', 'Jack Russell terrier'),
 ('Albus', 'Dumbledore', 'Phoenix'),
 ('Luna', 'Lovegood', 'Hare'),
 ('Cedric', 'Diggory', 'Unknown'),
 ('Severus', 'Snape', 'Doe')]

In [47]:
#Средний возраст по факультетам

%%sql
SELECT faculty, AVG(age) as average_age
FROM characters
WHERE age IS NOT NULL
GROUP BY faculty;

 * sqlite:///hogwarts.sqlite
Done.

[('Gryffindor', 36.0),
 ('Hufflepuff', 14.0),
 ('Ravenclaw', 11.0),
 ('Slytherin', 22.0)]

In [49]:
#Количеств книг на персонажа

%%sql
SELECT c.fname, c.lname, COUNT(l.book_name) as books_read
FROM characters c
JOIN library l ON c.char_id = l.char_id
GROUP BY c.char_id
ORDER BY books_read DESC;

 * sqlite:///hogwarts.sqlite
Done.

[('Lord', 'Voldemort', 1),
 ('Severus', 'Snape', 1),
 ('Cedric', 'Diggory', 1),
 ('Luna', 'Lovegood', 1),
 ('Albus', 'Dumbledore', 1),
 ('Gregory', 'Goyle', 1),
 ('Vincent', 'Crabbe', 1),
 ('Draco', 'Malfoy', 1),
 ('Ron', 'Weasley', 1),
 ('Hermione', 'Granger', 1),
 ('Harry', 'Potter', 1)]

In [53]:
#Сколько персонажей на каждом факультете 

%%sql
SELECT faculty, COUNT(*) AS character_count
FROM characters
GROUP BY faculty;

 * sqlite:///hogwarts.sqlite
Done.

[('Gryffindor', 4), ('Hufflepuff', 1), ('Ravenclaw', 1), ('Slytherin', 5)]

In [55]:
#Самые молодые персонажи

%%sql
SELECT fname, lname, age
FROM characters
WHERE age IS NOT NULL
ORDER BY age ASC
LIMIT 5;

 * sqlite:///hogwarts.sqlite
Done.

[('Harry', 'Potter', 11),
 ('Hermione', 'Granger', 11),
 ('Ron', 'Weasley', 11),
 ('Draco', 'Malfoy', 11),
 ('Vincent', 'Crabbe', 11)]

In [57]:
# Скольео книг прочитал каждый персонаж

%%sql
SELECT c.fname, c.lname, COUNT(l.book_name) AS books_read
FROM characters c
JOIN library l ON c.char_id = l.char_id
GROUP BY c.char_id
ORDER BY books_read DESC;

 * sqlite:///hogwarts.sqlite
Done.

[('Lord', 'Voldemort', 1),
 ('Severus', 'Snape', 1),
 ('Cedric', 'Diggory', 1),
 ('Luna', 'Lovegood', 1),
 ('Albus', 'Dumbledore', 1),
 ('Gregory', 'Goyle', 1),
 ('Vincent', 'Crabbe', 1),
 ('Draco', 'Malfoy', 1),
 ('Ron', 'Weasley', 1),
 ('Hermione', 'Granger', 1),
 ('Harry', 'Potter', 1)]

In [59]:
#Книги, которые читали студенты факультета 'Gryffindor'

%%sql
SELECT DISTINCT l.book_name
FROM library l
JOIN characters c ON l.char_id = c.char_id
WHERE c.faculty = 'Gryffindor';

 * sqlite:///hogwarts.sqlite
Done.

[('Quidditch Through The Ages',),
 ('Advanced Potion-Making',),
 ('A History Of Magic',),
 ('Magical Water Plants Of The Highland Rocks',)]

In [61]:
# Персонажи, которые не прочитали ни одной книги

%%sql
SELECT c.fname, c.lname
FROM characters c
LEFT JOIN library l ON c.char_id = l.char_id
WHERE l.book_name IS NULL;

 * sqlite:///hogwarts.sqlite
Done.

[]

In [63]:
#Найти дубликаты по имени и фамилии

%%sql
SELECT fname, lname, COUNT(*) as duplicates
FROM characters
GROUP BY fname, lname
HAVING COUNT(*) > 1;

 * sqlite:///hogwarts.sqlite
Done.

[]

In [65]:
#Проверка: у кого не указаны возраст или факультет

%%sql
SELECT fname, lname, age, faculty
FROM characters
WHERE age IS NULL OR faculty IS NULL;

 * sqlite:///hogwarts.sqlite
Done.

[('Lord', 'Voldemort', None, 'Slytherin')]